class Solution {
public:
    vector<int> lexicalOrder(int n) {
        vector<int> res(n);
        int val = 1;
        for (int i = 0; i < n; ++i) {
            res[i] = val;
            if (val * 10 <= n)
                val *= 10;
            else {
                if (val >= n)
                    val /= 10;
                val++;
                while (val%10 == 0) //20,200,300
                    val /= 10;
            }
        }
        return res;
    }
};
/*
在遍历下一个个位数之前，先遍历十位数，十位数的高位为之前的个位数，只要这个多位数并没有超过n，就可以一直往后遍历，如果超过了，我们除以10，然后再加1，如果加1后末尾形成了很多0，那么我们要用个while循环把0都去掉，然后继续运算
103:[1,10,100,101,102,103,11,12,13,14,15,16,17,18,19,2,20,21,22,23,24,25,26,27,28,29,3,30,31,32,33,34,35,36,37,38,39,4,40,41,42,43,44,45,46,47,48,49,5,50,51,52,53,54,55,56,57,58,59,6,60,61,62,63,64,65,66,67,68,69,7,70,71,72,73,74,75,76,77,78,79,8,80,81,82,83,84,85,86,87,88,89,9,90,91,92,93,94,95,96,97,98,99] 
*/
